# **`Lab3 - Data Engineering & EDA with Python, SQL, and Pandas`**

##### **Name** - Manu Mathew
##### **CourseID** - PROG8245
##### **Course** - Machine Learning Programming
##### **Student ID** - 8990691

---

**Install required packages**

In [51]:
%pip install psycopg2-binary pandas faker sqlalchemy scikit-learn

Requirement already satisfied: psycopg2-binary in ./.venv/lib/python3.13/site-packages (2.9.10)
Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.2.3)
Requirement already satisfied: faker in ./.venv/lib/python3.13/site-packages (37.3.0)
Requirement already satisfied: sqlalchemy in ./.venv/lib/python3.13/site-packages (2.0.41)
Requirement already satisfied: scikit-learn in ./.venv/lib/python3.13/site-packages (1.6.1)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.2.6)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: typing-extensions>=4.6.0 in ./.venv/lib/python3.13/site-packages (from sqlalchemy) (4.14.0)
Requirement already satisfied: scipy>=1.6.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.15.3)
Requirement already satisfied: joblib>=1.2.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (1.5.1)
Requirement already satisfied: threadpoolctl>=3.1.0 in ./.venv/lib/python3.13/site-packages (from scikit-learn) (3.6.0)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

`1 -- `
- Create a free SQL Database
- Create a table named employees with the following columns:
    - employee_id (integer, primary key)
    - name (string)
    - position (string, IT-related job titles)
    - start_date (date, between 2015 and 2024)
    - salary (integer, $60,000â€“$200,000)`

I have set up a Postgres database and also I have created the SQL table using the below SQL query

```SQL
CREATE TABLE employees (
  employee_id SERIAL PRIMARY KEY,
  name VARCHAR(50),
  position VARCHAR(50),
  start_date DATE,
  salary INTEGER
);

**Adding the imports**

In [52]:
import random
from faker import Faker
from datetime import date
import pandas as pd
# import psycopg2
from sqlalchemy import create_engine
from sklearn.preprocessing import MinMaxScaler

`2 --`
- Generate & Populate Data
    - Generate at least 50 synthetic records using Python and the Faker library.
    - Insert the data into your cloud database.

In [53]:
# Initializes faker object from the Faker library
fake = Faker()
# Position list that can be assigned randomly to employees
positions = ['Software Engineer', 'Data Analyst', 'DevOps Engineer', 'ML Engineer', 'QA Engineer','Backend Developer', 'Frontend Developer', 'Cloud Architect', 'SysAdmin', 'Data Scientist']
# Running a loop for 100 iterations
for i in range(100):
    # Replace single quote with double quotes
    name = fake.name().replace("'", "''")
    # Select random position for the employee
    position = random.choice(positions)
    # Select any date in the year between 2015 and 2024
    start_date = fake.date_between(start_date=date(2015,1,1), end_date=date(2024,6,1))
    # Select an integer between 60000 and 200000
    salary = random.randint(60000, 200000)
    # print 100 SQL insert queries
    print(f"INSERT INTO employees (name, position, start_date, salary) VALUES('{name}', '{position}', '{start_date}', {salary});")

INSERT INTO employees (name, position, start_date, salary) VALUES('Kevin Jones', 'Backend Developer', '2015-12-06', 158873);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Marks', 'SysAdmin', '2015-12-09', 108273);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Carpenter', 'Data Analyst', '2018-03-12', 146050);
INSERT INTO employees (name, position, start_date, salary) VALUES('Erika Brown', 'Backend Developer', '2020-08-07', 194457);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Donaldson', 'DevOps Engineer', '2016-06-13', 129795);
INSERT INTO employees (name, position, start_date, salary) VALUES('Victoria Jones', 'SysAdmin', '2021-07-21', 172442);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Bishop', 'QA Engineer', '2021-08-14', 112719);
INSERT INTO employees (name, position, start_date, salary) VALUES('Deborah Brown', 'Backend Developer', '2022-10-27', 72320);
INSERT INTO employees (name, position, start_date, salary) VALUES('Gary Thompson', 'Cloud Architect', '2017-08-13', 197102);
INSERT INTO employees (name, position, start_date, salary) VALUES('Douglas Maxwell', 'DevOps Engineer', '2015-10-22', 159265);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Nolan', 'DevOps Engineer', '2018-06-26', 114702);
INSERT INTO employees (name, position, start_date, salary) VALUES('Robert Williams', 'SysAdmin', '2021-10-23', 104543);
INSERT INTO employees (name, position, start_date, salary) VALUES('Matthew Porter', 'Data Analyst', '2023-11-07', 117695);
INSERT INTO employees (name, position, start_date, salary) VALUES('Richard Roman', 'Data Analyst', '2017-01-04', 132586);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Williams', 'Data Analyst', '2020-09-06', 189443);
INSERT INTO employees (name, position, start_date, salary) VALUES('Erika Quinn', 'Frontend Developer', '2022-07-29', 94787);
INSERT INTO employees (name, position, start_date, salary) VALUES('Marcus Shaffer', 'Cloud Architect', '2023-07-23', 151523);
INSERT INTO employees (name, position, start_date, salary) VALUES('Craig Bright', 'Cloud Architect', '2016-04-13', 109222);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Garcia', 'DevOps Engineer', '2018-05-19', 184098);
INSERT INTO employees (name, position, start_date, salary) VALUES('Leslie Sullivan', 'Cloud Architect', '2017-04-11', 68466);
INSERT INTO employees (name, position, start_date, salary) VALUES('Frank Roberts', 'Data Analyst', '2024-01-01', 102684);
INSERT INTO employees (name, position, start_date, salary) VALUES('Troy Harding DDS', 'DevOps Engineer', '2023-11-19', 87526);
INSERT INTO employees (name, position, start_date, salary) VALUES('Karen Brown', 'ML Engineer', '2019-08-04', 182227);
INSERT INTO employees (name, position, start_date, salary) VALUES('Hannah Harris', 'Data Analyst', '2015-02-15', 197745);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jessica Hicks', 'Data Analyst', '2021-12-28', 149678);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tammy Caldwell', 'Data Analyst', '2016-07-15', 141614);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mrs. Shelly Wilkins', 'ML Engineer', '2022-02-18', 74069);
INSERT INTO employees (name, position, start_date, salary) VALUES('Teresa Holt', 'QA Engineer', '2023-07-20', 62749);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Martinez', 'Data Scientist', '2018-05-11', 183199);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kelly Parks', 'QA Engineer', '2018-09-26', 178930);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ricky Dunn', 'DevOps Engineer', '2024-05-07', 170599);
INSERT INTO employees (name, position, start_date, salary) VALUES('George Castro', 'Data Analyst', '2022-03-11', 122240);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tracy Greene', 'SysAdmin', '2021-10-02', 73390);
INSERT INTO employees (name, position, start_date, salary) VALUES('Patricia Welch', 'ML Engineer', '2022-04-29', 184429);
INSERT INTO employees (name, position, start_date, salary) VALUES('Todd Delgado', 'Cloud Architect', '2022-03-23', 100185);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jay Sanders', 'Backend Developer', '2020-07-25', 170732);
INSERT INTO employees (name, position, start_date, salary) VALUES('Linda Ellis', 'Cloud Architect', '2020-01-12', 152744);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cheryl Wood', 'Data Analyst', '2020-02-23', 87033);
INSERT INTO employees (name, position, start_date, salary) VALUES('Angela Patton', 'Data Scientist', '2018-11-23', 149277);
INSERT INTO employees (name, position, start_date, salary) VALUES('Anne Ortiz', 'SysAdmin', '2022-12-01', 71907);
INSERT INTO employees (name, position, start_date, salary) VALUES('Vicki Silva', 'Frontend Developer', '2017-06-15', 101290);
INSERT INTO employees (name, position, start_date, salary) VALUES('Manuel Vargas', 'Data Analyst', '2024-02-18', 113134);
INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Smith', 'Data Analyst', '2015-02-02', 187251);
INSERT INTO employees (name, position, start_date, salary) VALUES('Stephanie Ortiz', 'Data Scientist', '2018-07-27', 100013);
INSERT INTO employees (name, position, start_date, salary) VALUES('Danielle Schultz', 'DevOps Engineer', '2023-03-26', 130550);
INSERT INTO employees (name, position, start_date, salary) VALUES('Melissa Dawson', 'Software Engineer', '2017-11-11', 131613);
INSERT INTO employees (name, position, start_date, salary) VALUES('Mr. Russell Sanchez PhD', 'Backend Developer', '2018-03-17', 124116);
INSERT INTO employees (name, position, start_date, salary) VALUES('Margaret Kaiser', 'Data Analyst', '2023-06-26', 190961);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jonathan Vasquez', 'Cloud Architect', '2018-09-18', 158770);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jamie Gonzalez', 'DevOps Engineer', '2018-12-20', 180015);
INSERT INTO employees (name, position, start_date, salary) VALUES('Alexis Williams', 'Backend Developer', '2017-08-16', 178173);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tracy Harris', 'Frontend Developer', '2023-05-23', 185637);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brian Wilkinson', 'SysAdmin', '2021-04-10', 192474);
INSERT INTO employees (name, position, start_date, salary) VALUES('Heather Nelson', 'Cloud Architect', '2022-08-12', 133760);
INSERT INTO employees (name, position, start_date, salary) VALUES('James Young', 'SysAdmin', '2016-12-15', 183170);
INSERT INTO employees (name, position, start_date, salary) VALUES('Daniel Houston', 'SysAdmin', '2015-01-11', 106880);
INSERT INTO employees (name, position, start_date, salary) VALUES('Kyle Johnson', 'Software Engineer', '2017-04-22', 60863);
INSERT INTO employees (name, position, start_date, salary) VALUES('Brenda Mccall', 'Backend Developer', '2019-06-27', 77905);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Reeves', 'Cloud Architect', '2018-07-30', 87330);
INSERT INTO employees (name, position, start_date, salary) VALUES('Garrett Castaneda', 'Data Analyst', '2016-09-28', 113567);
INSERT INTO employees (name, position, start_date, salary) VALUES('Miguel Brown', 'Data Scientist', '2016-04-18', 63792);
INSERT INTO employees (name, position, start_date, salary) VALUES('Nathan Santiago', 'Software Engineer', '2017-05-12', 102668);
INSERT INTO employees (name, position, start_date, salary) VALUES('Timothy Mahoney', 'Data Analyst', '2016-09-23', 155639);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michelle Castro', 'QA Engineer', '2015-05-20', 106142);
INSERT INTO employees (name, position, start_date, salary) VALUES('Sydney Carter', 'SysAdmin', '2023-07-11', 151453);
INSERT INTO employees (name, position, start_date, salary) VALUES('Troy Taylor', 'ML Engineer', '2017-08-29', 63539);
INSERT INTO employees (name, position, start_date, salary) VALUES('Robin Harris', 'Cloud Architect', '2019-06-18', 67284);
INSERT INTO employees (name, position, start_date, salary) VALUES('Ashley Kline', 'Data Analyst', '2024-02-14', 107991);
INSERT INTO employees (name, position, start_date, salary) VALUES('Martin Maxwell', 'Backend Developer', '2021-07-28', 156782);
INSERT INTO employees (name, position, start_date, salary) VALUES('Martha Allen', 'DevOps Engineer', '2018-07-25', 156450);
INSERT INTO employees (name, position, start_date, salary) VALUES('Steven Morris', 'ML Engineer', '2022-08-23', 196557);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jimmy Floyd', 'QA Engineer', '2023-04-14', 113962);
INSERT INTO employees (name, position, start_date, salary) VALUES('Wanda Taylor', 'DevOps Engineer', '2016-05-17', 185159);
INSERT INTO employees (name, position, start_date, salary) VALUES('Claudia Moon', 'Backend Developer', '2015-12-24', 96251);
INSERT INTO employees (name, position, start_date, salary) VALUES('Patrick Santana', 'Data Analyst', '2017-08-06', 98859);
INSERT INTO employees (name, position, start_date, salary) VALUES('Christopher Robinson', 'Frontend Developer', '2023-10-24', 167783);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jeffrey Fry', 'Frontend Developer', '2020-07-03', 152985);
INSERT INTO employees (name, position, start_date, salary) VALUES('Charles Miller', 'SysAdmin', '2019-09-24', 192413);
INSERT INTO employees (name, position, start_date, salary) VALUES('Andrew Ramirez', 'DevOps Engineer', '2016-06-03', 188854);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lisa Austin', 'SysAdmin', '2022-10-15', 152661);
INSERT INTO employees (name, position, start_date, salary) VALUES('Cassandra Cook', 'QA Engineer', '2021-06-27', 70094);
INSERT INTO employees (name, position, start_date, salary) VALUES('Bobby Coleman', 'QA Engineer', '2021-01-05', 189723);
INSERT INTO employees (name, position, start_date, salary) VALUES('Debra Richmond', 'ML Engineer', '2022-09-21', 173422);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jason Velazquez', 'QA Engineer', '2023-08-12', 136196);
INSERT INTO employees (name, position, start_date, salary) VALUES('John Hodges', 'Backend Developer', '2015-02-15', 172345);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tyler Williams', 'Cloud Architect', '2016-04-25', 172991);
INSERT INTO employees (name, position, start_date, salary) VALUES('Tiffany Kemp', 'DevOps Engineer', '2021-03-13', 193765);
INSERT INTO employees (name, position, start_date, salary) VALUES('Don Owens', 'Data Analyst', '2019-07-21', 189200);
INSERT INTO employees (name, position, start_date, salary) VALUES('Lucas Newman', 'Data Scientist', '2024-04-22', 187184);
INSERT INTO employees (name, position, start_date, salary) VALUES('Suzanne Graham', 'Data Analyst', '2023-11-23', 87729);
INSERT INTO employees (name, position, start_date, salary) VALUES('Charles Foley', 'Frontend Developer', '2016-10-11', 192560);
INSERT INTO employees (name, position, start_date, salary) VALUES('Roger Wood', 'Data Analyst', '2019-05-14', 117457);
INSERT INTO employees (name, position, start_date, salary) VALUES('Michael Kirby', 'DevOps Engineer', '2020-06-28', 63140);
INSERT INTO employees (name, position, start_date, salary) VALUES('Isaiah Brooks', 'DevOps Engineer', '2023-10-20', 132578);
INSERT INTO employees (name, position, start_date, salary) VALUES('Corey Galvan', 'Data Scientist', '2019-01-27', 186696);
INSERT INTO employees (name, position, start_date, salary) VALUES('Don Davis', 'QA Engineer', '2021-05-04', 188941);
INSERT INTO employees (name, position, start_date, salary) VALUES('Anna Ashley', 'Backend Developer', '2020-01-16', 70120);
INSERT INTO employees (name, position, start_date, salary) VALUES('Heather Smith', 'Cloud Architect', '2019-03-16', 126730);
INSERT INTO employees (name, position, start_date, salary) VALUES('Jordan Hudson', 'Data Analyst', '2016-08-31', 197226);
INSERT INTO employees (name, position, start_date, salary) VALUES('Peter Friedman', 'Frontend Developer', '2017-01-22', 88605);

`3--`
- Connect and Load Data
- Using Python, psycopg2, and Pandas, connect to your cloud database.
- Query the entire employee table and load the data into a Pandas DataFrame.
- Display the first few rows using df.head().

In [54]:
# Connection string
conn_str = "postgresql://neondb_owner:npg_Ppd3S2nUcWfx@ep-steep-rain-a8s0cnp2-pooler.eastus2.azure.neon.tech/neondb?sslmode=require"
# Create SQLAlchemy engine
engine = create_engine(conn_str)
# Query entire employee table and load the data into the dataframe
df = pd.read_sql_query("SELECT * FROM employees;", engine)
# Display the first few records , showing the first 50 records
print(df.head(50))
# Close the engine
engine.dispose()

    employee_id                   name            position  start_date  salary
0             1      Zachary Rogers MD            SysAdmin  2024-01-31  164268
1             2      Francis Castaneda        Data Analyst  2023-04-09   92677
2             3            Oscar Davis      Data Scientist  2019-02-12  114123
3             4            David Brown   Software Engineer  2021-05-11  183617
4             5         Corey Campbell            SysAdmin  2023-07-04   64790
5             6  Dr. Kyle Martinez DDS         ML Engineer  2017-01-11   86908
6             7        Kristin Russell         ML Engineer  2016-12-07   68990
7             8         Patricia Gates   Backend Developer  2018-04-02  140714
8             9          Kelly Carlson            SysAdmin  2019-12-18  107035
9            10        Samantha Hardin     DevOps Engineer  2016-11-04  198378
10           11           Brian Newman         ML Engineer  2019-09-07   94029
11           12      Mikayla Dickerson         ML Engineer  2020-06-20  171252
12           13          Robert Wilson   Backend Developer  2016-11-27   96765
13           14         Zachary Taylor            SysAdmin  2019-03-19  172969
14           15            Brooke Rice            SysAdmin  2015-06-06  114391
15           16          Ashley Arnold            SysAdmin  2021-02-24   85972
16           17            Amber Gould      Data Scientist  2015-01-22  142882
17           18       Christopher Diaz        Data Analyst  2016-06-05  187503
18           19        Travis Marshall   Software Engineer  2015-11-19  122830
19           20              Beth Hart     Cloud Architect  2017-05-28  156517
20           21        Brian Rodriguez     DevOps Engineer  2020-10-29  108627
21           22          Karen Nichols     Cloud Architect  2020-05-18  126015
22           23            Alan Garcia     DevOps Engineer  2020-09-04  124212
23           24           Ryan Winters        Data Analyst  2018-02-25  147986
24           25          Shelby Taylor      Data Scientist  2016-02-11  180404
25           26        Elizabeth Smith     Cloud Architect  2019-09-21   60200
26           27            Marvin Wood     DevOps Engineer  2016-05-05  184470
27           28            Sharon Hall            SysAdmin  2016-11-13  111090
28           29         Tracie Salazar     DevOps Engineer  2019-06-11  194233
29           30            Chris Smith         ML Engineer  2022-05-28  161000
30           31          Todd Anderson      Data Scientist  2020-10-01  104828
31           32           Brandi Casey   Backend Developer  2015-09-11  148238
32           33           Debra Davies  Frontend Developer  2015-04-19   83147
33           34    Samantha Oliver DDS      Data Scientist  2018-07-22   96135
34           35        Christina Floyd  Frontend Developer  2022-02-17  145760
35           36           Luke Griffin         ML Engineer  2019-11-27   88537
36           37           Sara Stewart        Data Analyst  2023-12-05   72123
37           38           Shirley Hart     Cloud Architect  2015-10-19  111158
38           39          Cynthia Reyes   Backend Developer  2019-11-27  102843
39           40           Adam Johnson        Data Analyst  2021-02-23   69521
40           41      Christina Gardner     DevOps Engineer  2022-03-25  172320
41           42           Anna Pittman  Frontend Developer  2023-12-04  198157
42           43             Juan Brown   Backend Developer  2015-06-21  151509
43           44           Brian Levine     Cloud Architect  2015-06-08  111293
44           45         Allison Miller            SysAdmin  2023-11-11  188380
45           46            Sherry Holt        Data Analyst  2018-09-01  169029
46           47          Larry Douglas        Data Analyst  2021-02-05  136119
47           48           Terry Harris     Cloud Architect  2023-03-11  190637
48           49             Seth Chang   Backend Developer  2018-08-18  107043
49           50           Deborah Ford  Frontend Developer  2020-10-04  130907

`3--`
**Explain each EDA step**

#### **Data Collection**

**`Database Setup and data collection`**
- Go to https://neon.tech/
- Sign up with your GitHub or Google account
- After logging in, click `Create a project`
- Set the project name.
- Choose any region and click `CreateProject`
- Once in the project dashboard page, click on the `connect` button on top right side.
- Copy the connection string
- Select the SQLEditor option , and then copy the SQL query below to create the employees table
- ```SQL
    CREATE TABLE employees (
    employee_id SERIAL PRIMARY KEY,
    name VARCHAR(50),
    position VARCHAR(50),
    start_date DATE,
    salary INTEGER
    );
- Generate 100 asynthetic records using Python and the Faker library. We generate 100 INSERT queries and copy the insert queries.
- Go to project dashboard page and then selected `SQLEditor` and then executed the 100 INSERT queries to insert the data into the cloud database.

#### **Data Cleaning**
- I checked for the missing values and I could find that there were no null or empty values present. This was checked using the command `df.info()`
- Also the data types for each columns names were correct as per the requirement using the command `df.info()`

In [55]:
# Column types and null counts
df.info()

# Check for the missing values
df.isnull().sum()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   employee_id  200 non-null    int64
 1   name         200 non-null    object
 2   position     200 non-null    object
 3   start_date   200 non-null    object
 4   salary       200 non-null    int64
dtypes: int64(2), object(3)
memory usage: 7.9+ KB

employee_id    0
name           0
position       0
start_date     0
salary         0
dtype: int64

#### **Data Transformation**
- As part of data transformation , I have created a new column `years_of_service` by calculating the difference between the current date and the sart_date

In [56]:
df['years_of_service'] = date.today().year - pd.DatetimeIndex(df['start_date']).year
df.head()

,employee_id,name,position,start_date,salary,years_of_service
0,1,Zachary Rogers MD,SysAdmin,2024-01-31,164268,1
1,2,Francis Castaneda,Data Analyst,2023-04-09,92677,2
2,3,Oscar Davis,Data Scientist,2019-02-12,114123,6
3,4,David Brown,Software Engineer,2021-05-11,183617,4
4,5,Corey Campbell,SysAdmin,2023-07-04,64790,2

#### **Feature Engineering**
- As a part of the feature engineering, I have added a new column
**Seniority Level** -
  - "Junior" if they have worked less than 3 years
  - "Mid-Level" if they have worked between 3 and 6 years
  - "Senior" if they have worked more than 6 years

  `To implement the Seniority Level, I used the lamda function`.

In [57]:
# Create a seniority level based on years of service
df['seniority'] = df['years_of_service'].apply(
    lambda x: 'Junior' if x < 3 else 'Mid-Level' if x < 7 else 'Senior'
)

# Show new features
df[['employee_id', 'name', 'position', 'years_of_service', 'seniority']].head()

,employee_id,name,position,years_of_service,seniority
0,1,Zachary Rogers MD,SysAdmin,1,Junior
1,2,Francis Castaneda,Data Analyst,2,Junior
2,3,Oscar Davis,Data Scientist,6,Mid-Level
3,4,David Brown,Software Engineer,4,Mid-Level
4,5,Corey Campbell,SysAdmin,2,Junior

#### **Scaling**
- As a part of the feature scaling, I have added a `new column` called **Normalized Salary**. Salary are usually in large numbers like $80,000 or $150,000, which can be hard to compare so I used a method called *Min-Max Scaling* to convert all salaries to a range between **0 and 1** and this makes it easier to make visualizations.

In [58]:
# Normalize the salary column using Min-Max Scaling
minmax = MinMaxScaler()
df['normalized_salary'] = minmax.fit_transform(df[['salary']])

df[['employee_id', 'name', 'position', 'normalized_salary', 'years_of_service', 'seniority']].head()

,employee_id,name,position,normalized_salary,years_of_service,seniority
0,1,Zachary Rogers MD,SysAdmin,0.753144,1,Junior
1,2,Francis Castaneda,Data Analyst,0.235037,2,Junior
2,3,Oscar Davis,Data Scientist,0.390243,6,Mid-Level
3,4,David Brown,Software Engineer,0.893174,4,Mid-Level
4,5,Corey Campbell,SysAdmin,0.033218,2,Junior